

 
"
%
&
(
)
*
+
,
-
.
/
0
1
2
3
4
5
6
7
8
9
:
<UNK>
>
?
@
A
B
C
D
E
F
G
H
I
J
K
L
M
N
O
P
Q
R
S
T
U
V
W
X
Y
Z
[
]
_
a
b
c
d
e
f
g
h
i
k
l
m
n
o
p
q
r
s
t
u
v
w
x
y
z
~
·
é
Φ
β
—
‘
’
“
”
…
″
℃
Ⅱ
⊙
■
□
◆
○
◎
★
　
、
。
〈
〉
《
》
一
丁
七
万
丈
三
上
下
不
与
专
且
世
业
东
丝
两
严
丧
个
中
丰
串
临
丹
为
主
丽
举
乃
久
么
义
之
乌
乎
乏
乐
乒
乔
乖
乘
乙
九
乞
也
习
乡
书
买
乱
乳
乾
了
予
争
事
二
于
亏
云
互
五
井
亚
些
亡
亢
交
亦
产
亩
享
京
亭
亮
亲
人
亿
什
仁
仅
今
介
仍
从
仑
仓
仔
仕
他
仗
付
代
令
以
仪
们
仰
仲
件
价
任
份
仿
企
伊
伍
伏
伐
休
众
优
伙
会
伞
伟
传
伤
伥
伦
伯
估
伴
伶
似
但
位
低
住
体
何
余
作
你
佣
佩
佬
佰
佳
佼
使
侈
例
侍
供
依
侠
侥
侧
侵
便
促
俄
俊
俏
俗
保
俞
信
修
俱
俺
倍
倒
候
借
倡
倩
倪
债
值
倾
假
偏
做
停
健
偶
偿
储
催
像
僵
僻
儒
儿
允
元
兄
充
兆
先
光
克
免
兑
兔
兖
入
全
八
公
六
兰
共
关
兴
兵
其
具
典
养
兼
冀
内
冉
册
再
写
军
农
冠
冤
冬
冯
冰
冲
决
况
冶
冷
冻
冼
净
准
凌
减
凝
几
凡
凤
凭
凯
凶
凸
出
击
凿
刀
刃
分
切
刊
刑
划
列
刘
则
刚
创
初
判
利
别
刮
到
制
刷
券
刺
刻
剂
削
前
剑
剔
剥
剧
剩
副
割
力
劝
办
功
加
务
劣
动
助
努
励
劲
劳
势
勃
勇
勉
勋
勒
募
勤
勾
勿
包
化
北
匡
匣
匪
匹
区
医
十
千
升
午
卉
半
华
协
卑
卓
单
卖
南
博
占
卡
卫
印
危
即
却
卵
卷
卸
卿
厂
厅
历
厉
压
厚
原
厢
厦
厮
去
县
参
又
叉
及
友
双
反
发
取
受
变
叙
叠
口
古
句
另
只
叫
召
可
台
叱
史
右
叶
号
司
叹
吁
吃
各
吆
合
吉
吊
同
名
后
吐
向
吓
吕
吗
君
吞
否
吧
吨
含
听
启
吴
吸
吹
吾
呈
告
呗
员
呢
周
味
呼
命
咋
和
咎
咖
咤
咨
咸
咽
品
哄
哈
响
哥
哪
哭
哲
唇
唏
唐
唤
售
唯
唱
商
啊
啡
啤
啥
啸
善
喉
喊
喋
喘
喜
喝
喷
喻
嗅
嘈
嘉
嘘
嘴
器
噪
囊
四
回
因
团
囤
园
困
围
固
国
图
圆
圈
土
圣
在
地
圳
场
均
坊
坏
坐
坑
块
坚
坛
坝
坡
坤
坦
坯
垄
型
垒
垫
埃
埋
城
域
培
基
堂
堆
堪
堵
塌
塑
塔
塞
填
境
墅
墒
墙
增
墨
壁
壤
士
壮
声
壳
壶
处
备
复
夏
夕
外
夙
多
夜
够
夥
大
天
太
夫
夭
央
夯
失
头
夷
夺
奇
奈
奉
奋
奏
契
奔
奖
套
奠
奢
奥
女
奶
她
好
如
妆
妇
妙
妥
妨
始
姐
姓
委
姜
姿
威
娄
娜
娟
娱
婚
婧
婷
媒
媲
嫁
嫌
嫩
嬉
子
孔
孕
字
存
孙
季
孤
学
孩
孰
宁
它
宅
宇
守
安
宋
完
宏
宕
宗
官
宙
定
宛
宜
宝
实
宠
审
客
宣
室
宪
宫
害
宴
宵
家
容
宽
宾
宿
寂
寄
密
寇
富
寒
寓
察
寡
寥
寮
寸
对
寺
寻
导
寿
封
将
尊
小
少
尔
尖
尘
尚
尝
尤
尬
就
尴
尹
尼
尽
尾
局
层
居
屈
届
屋
展
属
屡
履
屯
山
屿
岁
岌
岐
岗
岚
岛
岩
岬
岭
岸
峡
峥
峰
峻
崛
崩
崭
川
州
巢
工
左
巧
巨
巩
巫
差
己
已
巴
币
市
布
帅
帆
师
希
帝
带
席
帮
帷
常
帽
幅
幕
干
平
年
并
幸
幻
幼
幽
广
庄
庆
序
库
应
底
店
府
庞
废
度
座
庭
庵
康
庸
廉
延
廷
建
开
异
弃
弄
弈
弊
式
引
弘
弛
弟
张
弥
弦
弯
弱
弹
强
归
当
录
形
彦
彩
彪
彬
彭
彰
影
彻
彼
往
征
径
待
很
徊
律
徐
徒
得
徘
徙
御
循
微
德
徽
心
必
忆
忌
忍
志
忘
忙
忠
忧
快
念
忽
忿
怀
态
怎
怒
怕
怖
思
急
性
怨
怪
总
恋
恐
恒
恕
恢
恨
恩
息
恰
恳
恶
恼
悄
悉
悟
悠
患
悦
您
悬
悲
悸
情
惊
惋
惑
惕
惜
惟
惠
惧
惨
惩
惯
想
愁
愈
意
愕
感
愠
愤
愧
愿
慈
慌
慎
慑
慢
慧
慨
慰
憾
懂
懈
懊
懵
戏
成
我
戒
或
战
戛
截
戴
户
房
所
扇
手
才
扎
打
托
扣
执
扩
扫
扬
扭
扮
扰
扶
批
找
承
技
抄
抉
把
抑
抓
投
抗
折
抚
抛
抢
护
报
披
抬
抱
抵
押
抽
担
拆
拉
拍
拐
拒
拓
拔
拖
招
拜
拟
拢
拥
拦
拨
择
括
拭
拯
拳
拼
拾
拿
持
挂
指
按
挑
挖
挡
挣
挤
挥
挨
挪
挫
振
挺
挽
捅
捆
捉
捍
捏
捕
损
换
捧
据
捷
掀
授
掉
掌
掏
掐
排
掘
探
接
控
推
掩
措
掮
掷
描
提
插
握
揭
援
揽
搅
搞
搬
搭
携
摄
摆
摇
摊
摘
摩
摸
摹
撑
撞
撤
播
撰
擅
操
擎
擦
攀
攒
支
收
改
攻
放
政
故
效
敌
敏
救
教
敛
敞
敢
散
敦
敬
数
敲
整
文
斋
斌
斐
斑
斗
料
斤
斥
断
斯
新
方
施
旁
旅
旋
旎
族
旗
无
既
日
旦
旧
早
旬
旭
旱
时
旺
昂
昆
昊
昌
明
易
星
映
春
昨
是
显
晋
晒
晓
晔
晕
晖
晚
晤
晨
普
景
晰
晴
晶
智
暂
暇
暖
暗
暴
曙
曝
曰
曲
更
曹
曼
曾
替
最
月
有
朋
服
朗
望
朝
期
木
未
末
本
术
朱
朵
机
朽
杀
杂
权
杆
李
材
村
杜
束
杠
条
来
杨
杭
杯
杰
松
板
极
构
枉
析
林
枚
果
枝
枣
枪
枯
架
柄
柏
某
染
柜
查
柱
柳
柴
标
栋
栏
树
校
栩
样
核
根
格
栽
桂
框
案
桌
桐
桔
档
桥
桶
梁
梅
梦
梧
梯
械
梳
梵
检
棉
棋
棒
棕
森
棵
椅
植
楚
楹
楼
概
榈
榜
榨
榷
槌
槛
槽
模
横
橡
檀
欠
次
欢
欧
欲
款
歇
歉
歌
止
正
此
步
武
歧
死
殊
残
殖
段
毅
毋
母
每
毒
比
毕
毙
毛
毫
民
气
氛
氨
氯
水
永
求
汇
汉
汐
汗
汛
江
池
污
汤
汪
汰
汽
沂
沃
沈
沉
沙
沟
没
沦
沪
沫
河
沸
油
治
沽
沿
泄
泉
法
泛
泠
泡
波
泣
泥
注
泰
泻
泽
洁
洋
洗
洞
津
洪
洲
活
洽
派
流
浅
浇
测
济
浑
浓
浙
浦
浪
浮
海
消
涉
涌
涛
涝
润
涨
液
涵
淀
淆
淋
淘
淞
淡
淮
深
混
添
清
渊
渐
渔
渗
渠
渡
渣
温
港
游
湖
湘
湛
湾
溃
溉
源
溢
溶
滋
滑
滚
滞
满
滥
滨
滩
滴
漏
漓
演
漫
漳
潍
潘
潜
潞
潮
澄
澜
澳
激
瀑
灌
火
灭
灯
灵
灾
炉
炎
炒
炭
炮
炳
炸
点
炼
烈
烟
烦
热
烯
焉
焕
焦
焰
然
煎
煜
煤
照
熊
熙
熟
熬
燃
爆
爬
爱
父
爸
片
版
牌
牙
牛
牟
牢
牧
物
牵
特
犀
犁
犯
状
犹
狂
狙
狠
独
猎
猛
猜
猪
猫
献
獐
率
玉
王
玩
环
现
玲
玺
珀
珍
珠
班
球
理
琏
琐
琛
琢
琪
琳
琼
瑞
瑾
璐
璧
瓦
瓶
瓷
甘
甚
甜
生
用
田
由
甲
申
电
男
画
畅
界
留
畜
略
番
畴
疆
疏
疑
疗
疚
疫
疯
疲
疼
疾
病
症
痕
痛
瘦
癌
登
白
百
的
皆
皇
皮
盆
盈
益
盎
盐
监
盒
盖
盘
盛
盟
目
盲
直
相
盼
盾
省
眉
看
真
眼
着
睐
睡
督
睫
睿
瞄
瞒
瞩
瞬
瞻
矛
矢
矣
知
矩
矫
短
石
矿
码
砂
研
砖
砚
砝
砥
破
砷
砸
础
硕
硝
硫
硬
确
碍
碎
碑
碰
碳
磅
磊
磨
示
礼
社
祈
祖
祝
神
祥
票
祷
祸
禁
福
禧
离
秀
私
秉
秋
种
科
秘
租
秣
秦
秩
积
称
移
稀
程
稍
税
稳
稻
稼
稽
稿
穆
穴
究
穷
空
穿
突
窄
窍
窑
窒
窗
窘
立
站
竞
竟
章
童
竭
端
竹
笃
笈
笑
笔
符
第
笼
等
筋
筑
答
策
筹
签
简
算
管
箭
箱
篆
篇
篮
籍
米
类
籼
籽
粉
粕
粗
粘
粟
粮
粹
精
糊
糕
糖
糟
系
紊
素
索
紧
紫
累
繁
纠
红
约
级
纪
纯
纱
纲
纳
纵
纶
纷
纸
纹
纺
纽
线
练
组
细
织
终
绍
绎
经
绑
结
绕
绘
给
络
绝
统
继
绩
绪
续
维
绸
综
绿
缄
缆
缓
编
缘
缠
缩
缪
缴
缺
罐
网
罕
罗
罚
罢
罩
罪
置
署
罹
羊
美
群
羹
羽
翁
翔
翘
翟
翦
翰
翻
翼
老
考
耄
者
耆
而
耐
耕
耗
耳
耻
耿
聊
职
联
聘
聚
肃
肆
肇
肉
肋
肖
肘
股
肥
肯
育
胀
胁
胆
背
胎
胜
胡
胶
能
脂
脉
脑
脚
脱
脸
脾
腊
腐
腰
腺
腻
腾
膜
膨
自
至
致
臼
舆
舍
舒
舞
航
般
舰
舱
舵
船
良
艰
色
艳
艺
艾
节
芜
芝
芦
芬
花
芳
苍
苏
苑
苗
苟
若
苦
英
苹
茂
范
茅
茏
茧
茫
茬
茵
茶
荆
草
荒
荟
荡
荣
药
荷
荼
莉
莞
莠
莫
莱
莲
获
莹
菊
菏
菔
菜
菩
菱
菲
萃
萄
萌
萍
萎
营
萦
萧
萨
落
著
葡
董
葫
葱
葵
蒋
蒙
蒜
蒲
蒸
蓄
蓉
蓓
蓝
蓬
蔓
蔗
蔡
蔬
蔽
蕴
蕾
薄
薪
藏
虎
虑
虚
虹
虽
蚕
蛛
蛟
蜂
蝉
蝠
融
螭
螺
蟠
血
行
衍
衔
街
衡
衣
补
表
衰
衷
袁
袋
袖
被
袭
裁
裂
装
裔
裕
裳
裸
褂
褪
襟
西
要
覆
见
观
规
视
览
觉
觑
角
解
触
言
誉
警
譬
计
订
认
讨
让
训
议
讯
记
讲
讳
许
论
设
访
证
评
识
诉
诊
词
译
试
诗
诚
诛
话
诞
询
该
详
语
误
诱
说
请
诸
诺
读
课
诿
谁
调
谅
谈
谊
谋
谐
谓
谛
谢
谨
谭
谱
谷
豆
象
贝
负
贡
财
责
贤
败
账
货
质
贪
贫
贬
购
贯
贰
贲
贴
贵
贷
贸
费
贺
贾
资
赋
赌
赎
赔
赖
赚
赛
赝
赞
赠
赢
赤
赫
走
赴
赵
赶
起
趁
超
越
趋
趣
足
跃
跌
跑
距
跟
跨
路
跳
践
跷
跻
踊
踌
踏
踞
踩
踪
踵
蹈
蹶
躁
躇
身
车
轨
轩
转
轮
软
轰
轲
轻
载
轿
较
辅
辆
辈
辉
辑
输
辗
辙
辛
辞
辨
辩
辰
边
达
迁
迄
迅
过
迈
迎
运
近
返
还
这
进
远
违
连
迟
迥
迪
迫
迭
述
迷
迹
追
退
送
适
逃
逆
选
逊
透
逐
递
途
通
速
造
逢
逸
逻
逼
逾
遂
遇
遍
遏
道
遗
遣
遥
遭
遵
避
邀
邑
邓
那
邦
邮
邯
邱
邻
郁
郊
郎
郑
郝
部
郭
郴
郸
都
酋
配
酒
酝
酬
酯
酿
醇
醒
采
釉
释
里
重
野
量
金
鉴
鑫
针
钉
钞
钟
钢
钧
钩
钮
钰
钱
钵
钽
钾
铀
铁
铅
铜
铝
铭
银
铸
铺
链
销
锁
锋
锌
锐
错
锦
键
锯
锻
镀
镇
镑
镜
长
门
闪
闫
闭
问
闯
闲
间
闷
闸
闹
闻
阁
阅
阐
阔
阜
队
阱
防
阳
阴
阵
阶
阻
阿
附
际
陆
陈
降
限
陕
陡
院
除
险
陵
陶
陷
隆
随
隐
隔
隙
障
隶
隽
难
雀
雁
雄
雅
集
雇
雕
雨
雪
雯
零
雷
雾
需
霁
霄
震
霜
霞
露
霸
霾
青
靓
靖
静
非
靠
靡
面
革
鞭
韦
韩
韬
音
韵
页
顶
顷
项
顺
须
顾
顿
预
领
颇
颈
频
颖
颗
题
颜
额
风
飓
飘
飙
飚
飞
食
餐
饭
饮
饰
饱
饲
馈
馏
首
香
馨
马
驰
驱
驳
驻
驾
骂
骄
骋
验
骑
骚
骤
骨
高
鬼
魁
魏
鱼
鲁
鲍
鲜
鳄
鸡
鸣
鸿
鹏
鹭
鹰
鹿
麦
麻
黄
黎
黑
默
黯
鼎
鼓
鼠
齐
齿
龙
龚
！
％
（
）
，
－
．
／
：
；
？
～
